In [1]:
# 5.3 Summarizing and Computing Descriptive Statistics

import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
      [np.nan, np.nan], [0.75, -1.3]],
   index=['a', 'b', 'c', 'd'], columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [3]:
# Compared with the similar methods found on NumPy arrays, 
# they have built-in handling for missing data

# By default, for each columns
res = df.sum()
print(res)
print('-----')

res = df.sum(skipna=False)
print(res)

one    9.25
two   -5.80
dtype: float64
-----
one   NaN
two   NaN
dtype: float64

In [4]:
# Table 5-7
# axis: 0 for DataFrameâ€™s rows and 1 for columns
# skipna: Exclude missing values; True by default

# vs. Passing axis='columns' or axis=1 sums across the columns instead:
res = df.sum(axis='columns')
print(res)
print('-----')

# same
res = df.sum(axis= 1 , skipna=False)
print(res)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64
-----
a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [5]:
#  idxmin and idxmax, return index value where the minimum or maximum values are attained
print(df)
print('--------')
print(df['one'].idxmax())
print(df['one'].idxmin())

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3
--------
b
d

In [6]:
# accumulation function
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [7]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [8]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [9]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

Table 5-8

count
describe
min, max
idxmin, idxmax
quantile
sum
mean
median
prod
var
std
skew
cumsum
cumprod
diff

In [10]:
#conda install pandas-datareader

In [11]:
import pandas_datareader.data as web
all_data = {ticker: web.get_data_yahoo(ticker)
            for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
                      for ticker, data in all_data.items()})

In [13]:
returns = price.pct_change()
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2020-10-12  0.063521 -0.004539  0.025902  0.035592
2020-10-13 -0.026527 -0.016587  0.006594  0.001612
2020-10-14  0.000743  0.006715 -0.008974 -0.002291
2020-10-15 -0.003961 -0.008337 -0.005433 -0.005708
2020-10-16 -0.014001  0.008327  0.000000  0.008902

In [14]:
#corr method of Series computes the correlation 
returns['MSFT'].corr(returns['IBM'])

0.5695461588928031

In [ ]:
#cov computes the covariance:
returns['MSFT'].cov(returns['IBM'])

In [15]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.496296  0.709820  0.659468
IBM   0.496296  1.000000  0.569546  0.529872
MSFT  0.709820  0.569546  1.000000  0.785569
GOOG  0.659468  0.529872  0.785569  1.000000

In [16]:
returns.corrwith(returns.IBM)

AAPL    0.496296
IBM     1.000000
MSFT    0.569546
GOOG    0.529872
dtype: float64

In [ ]:
#5.3.2 Unique Values, Value Counts, and Membership

In [25]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
print(obj.index)
print(obj.values)
obj

RangeIndex(start=0, stop=9, step=1)
['c' 'a' 'd' 'a' 'a' 'b' 'b' 'c' 'c']

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [26]:
# Use unique() function
res = obj.unique()
res

array(['c', 'a', 'd', 'b'], dtype=object)

In [27]:
# value_counts() function
res = obj.value_counts()
res

c    3
a    3
b    2
d    1
dtype: int64

In [30]:
pd.value_counts(obj.values, sort=True)

c    3
a    3
b    2
d    1
dtype: int64

isin performs a vectorized set membership check 
and can be useful in filtering a dataset down to a subset of values

In [35]:
# use isin
print(obj)
print('-------------')
mask = obj.isin(['b','c'])
print('-------------')
print(mask)
print('-------------')
print(obj[mask])
print('-------------')
obj[obj.isin(['b','c'])]

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object
-------------
-------------
0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool
-------------
0    c
5    b
6    b
7    c
8    c
dtype: object
-------------

0    c
5    b
6    b
7    c
8    c
dtype: object

Table 5 - 9

isin
match
unique
value_counts

In [ ]:
# Practice Example:

In [36]:
df = pd.read_csv("data//shows.csv")
df

    Age  Experience  Rank Nationality   Go
0    36          10     9          UK   NO
1    42          12     4         USA   NO
2    23           4     6           N   NO
3    52           4     4         USA   NO
4    43          21     8         USA  YES
5    44          14     5          UK   NO
6    66           3     7           N  YES
7    35          14     9          UK  YES
8    52          13     7           N  YES
9    35           5     9           N  YES
10   24           3     5         USA   NO
11   18           3     7          UK  YES
12   45           9     9          UK  YES

In [38]:
df.shape

(13, 5)

In [40]:
df.head()

   Age  Experience  Rank Nationality   Go
0   36          10     9          UK   NO
1   42          12     4         USA   NO
2   23           4     6           N   NO
3   52           4     4         USA   NO
4   43          21     8         USA  YES

In [39]:
df.tail()

    Age  Experience  Rank Nationality   Go
8    52          13     7           N  YES
9    35           5     9           N  YES
10   24           3     5         USA   NO
11   18           3     7          UK  YES
12   45           9     9          UK  YES

In [42]:
df.describe()

             Age  Experience       Rank
count  13.000000   13.000000  13.000000
mean   39.615385    8.846154   6.846154
std    13.263600    5.727800   1.908147
min    18.000000    3.000000   4.000000
25%    35.000000    4.000000   5.000000
50%    42.000000    9.000000   7.000000
75%    45.000000   13.000000   9.000000
max    66.000000   21.000000   9.000000

In [46]:
#df
print(df.index)
print(df.values)

RangeIndex(start=0, stop=13, step=1)
[[36 10 9 'UK' 'NO']
 [42 12 4 'USA' 'NO']
 [23 4 6 'N' 'NO']
 [52 4 4 'USA' 'NO']
 [43 21 8 'USA' 'YES']
 [44 14 5 'UK' 'NO']
 [66 3 7 'N' 'YES']
 [35 14 9 'UK' 'YES']
 [52 13 7 'N' 'YES']
 [35 5 9 'N' 'YES']
 [24 3 5 'USA' 'NO']
 [18 3 7 'UK' 'YES']
 [45 9 9 'UK' 'YES']]

In [48]:
# Single col
print(df.Age)
df['Age']

0     36
1     42
2     23
3     52
4     43
5     44
6     66
7     35
8     52
9     35
10    24
11    18
12    45
Name: Age, dtype: int64

0     36
1     42
2     23
3     52
4     43
5     44
6     66
7     35
8     52
9     35
10    24
11    18
12    45
Name: Age, dtype: int64

In [49]:
# columns
df[['Age','Rank']]

    Age  Rank
0    36     9
1    42     4
2    23     6
3    52     4
4    43     8
5    44     5
6    66     7
7    35     9
8    52     7
9    35     9
10   24     5
11   18     7
12   45     9

In [51]:
# Average , youngest, oldest age?
print(df['Age'].mean())
print(df['Age'].max())
print(df['Age'].min())

39.61538461538461
66
18

In [56]:
# find the oldest from which country?, Go or Not?
i = df['Age'].idxmax()
print(i)
print(df['Go'].iloc[i])
print(df['Nationality'].iloc[i])
df

6
YES
N

    Age  Experience  Rank Nationality   Go
0    36          10     9          UK   NO
1    42          12     4         USA   NO
2    23           4     6           N   NO
3    52           4     4         USA   NO
4    43          21     8         USA  YES
5    44          14     5          UK   NO
6    66           3     7           N  YES
7    35          14     9          UK  YES
8    52          13     7           N  YES
9    35           5     9           N  YES
10   24           3     5         USA   NO
11   18           3     7          UK  YES
12   45           9     9          UK  YES

In [61]:
# find the youngest from which country?, Go or Not?
i = df['Age'].idxmin()
print(df['Go'].iloc[i])
print(df['Nationality'].iloc[i])

print('-------')
# or
age = df['Age'].min()
print(df[df['Age']==age]['Age'])
print(df[df['Age']==age]['Go'])
print(df[df['Age']==age]['Nationality'])

YES
UK
-------
11    18
Name: Age, dtype: int64
11    YES
Name: Go, dtype: object
11    UK
Name: Nationality, dtype: object